## Missing Data

In [ ]:
import numpy as np
import pandas as pd

In [69]:
### Crteating a DataFrame with some NaN values
dictionary = {'A':[1, 3, np.nan, 4],
             'B':[4, np.nan, np.nan, 8],
             'C':[10, 20, 30, 40]}
df = pd.DataFrame(dictionary)
df

     A    B   C
0  1.0  4.0  10
1  3.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

### Remove NaN values
* df.dropna()

In [20]:
#Default all missing values(Rows & Columns) will be removed
df.dropna()

     A    B   C
0  1.0  4.0  10
3  4.0  8.0  40

In [23]:
#axis=0/1 removes row_wise or coloumn_wise values
df.dropna(axis=0)

     A    B   C
0  1.0  4.0  10
3  4.0  8.0  40

In [24]:
#axis=0/1 removes row_wise or coloumn_wise values
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

### thresh=2 will keep, at least 2 None-NaN values are existed
#### df.dropna(thresh = a_number)

In [34]:
#thresh=2 will keep, if at least 2 None-NaN values are existed
# Except row-2, all have at least 2 None-NaN values
df.dropna(thresh=2)

     A    B   C
0  1.0  4.0  10
1  3.0  NaN  20
3  4.0  8.0  40

In [37]:
# Column 'A' and 'C' have al least 3 None-NaN values
# So column 'B' will no longer there

df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  3.0  20
2  NaN  30
3  4.0  40

In [39]:
# if we want at least 25% None-NaN value
percent = 0.75* len(df)
df.dropna(axis=1, thresh=percent)

     A   C
0  1.0  10
1  3.0  20
2  NaN  30
3  4.0  40

### Filling the NaN or misiing data
* df.fillna(value='...')

In [40]:
df.fillna(value='FILL VALUE')

            A           B   C
0           1           4  10
1           3  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [42]:
# data type will be as same as existing row/col values
df.fillna(value=0)

     A    B   C
0  1.0  4.0  10
1  3.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [44]:
# Fill particular row/col
df['A'].fillna(value=0)

0    1.0
1    3.0
2    0.0
3    4.0
Name: A, dtype: float64

In [68]:
# For permanently changing
df['A'] = df['A'].fillna(value= 0)
df

     A    B   C
0  1.0  4.0  10
1  3.0  6.0  20
2  0.0  6.0  30
3  4.0  8.0  40

In [70]:
#Column 'B' will be filled by average of 'B'
avgB = df['B'].mean()
df['B'] = df['B'].fillna(value=avgB)
df

     A    B   C
0  1.0  4.0  10
1  3.0  6.0  20
2  NaN  6.0  30
3  4.0  8.0  40

In [71]:
df.fillna(value=df.mean())

          A    B   C
0  1.000000  4.0  10
1  3.000000  6.0  20
2  2.666667  6.0  30
3  4.000000  8.0  40

In [73]:
# 'A' col is filled by mena of col-'A' 
df.mean()

A     2.666667
B     6.000000
C    25.000000
dtype: float64